(function($) {
    $(document).ready(function () {

        //print random jokes in the aside in the home page
        var myArray = [];

        myArray.push("Ако “дебъгване” е процесът по отстраняване на проблеми в програмния код, то тогава “програмиране” явно е процесът по вкарването им вътре. ");
        myArray.push("Жена на програмист го праща до магазина: <br/>– Да купиш един салам и ако има яйца – 10.<br/>След малко мъжът се връща с десет салама. Жена му го пита: " +
        "<br/>– Какви са тези салами? Защо си купил 10 салама. <br/>– Как защо?! – имаше яйца…");
        myArray.push("Програмист се прибира в пет часа сутринта. Жена му изнервена го очаква на вратата: <br/> - Миришеш ми на чужди компютри…")
        myArray.push("Младеж, завършил институт и постъпил на работа във фирма. На втория ден началникът го извикал и попитал: <br/> " +
        "- Ти силен програмист ли си? <br/>- Как да ви кажа? <br/>- Е силен ли си? <br/>- В общи линии, да. <br/>- Тогава ще се заемеш с преместването на компютрите.")
        myArray.push("Истинският програмист не може да умре от глад, дори хладилника да е празен. Той винаги може да изкара поне още една седмица с хранителните запаси натрупали се в клавиатурата.")
        myArray.push("Въпрос: Защо програмистите не са добри в леглото? <br/>Отговор: Защото винаги търсят бързодействие! ")
        myArray.push("Въпрос: Кое е 8 пъти по-лошо от битовия алкохолизъм? <br/>Отговор: Байтовият алкохолизъм, разбира се! ");
        myArray.push("Един геймър умрял и го пратили в ада. След една седмица главният дявол бяга при Господ и реве: <br/>- Какъв е този, дето си ми го пратил?" +
        "<br/>Господ недоумява. <br/>- Не мога повече! Вземаи го при теб! <br/>- Защо, бе? - пита Господ. <br/>- Как защо! Изби всички дяволи, обърна всички казани и пита къде е изхода за другото ниво! ");
        myArray.push("Час по английски. Учителят: <br/>- Как е на английски гума?<br/>Син на програмист: <br/>- Бекспейс. ");
        myArray.push("Програмист се разхожда в планината. Огледал заобикалящата го природа и си казал: <br/>- Каква яка графика! ")
        myArray.push("Програмист се налива цяла нощ с ракия. Преди да престане да дава признаци на живот, решава да дръпне една биричка. Взима чаша, бутилка и започва нервно да си налива. В този момент изпуска чашата и замислено промълвява:<br/>" +
        "– Мммдааааааа. Интересен бъг… ");
        myArray.push("Жена на програмист казва на мъжа си:<br/>– Скъпи, искам да имаме дете!<br/>– Добре, лягай, сега ще го инсталираме! ");
        myArray.push("Програмист се прибира след работа вкъщи. Още от вратата го посреща котката и започва усилено да го лиже по ръката и да мърка. Жена му гледа учудена:<br/>" +
        "– Кво й става на тая котка? Гледай как те ближе по ръката!<br/>– Как какво бе, мирише й на мишка… ");
        myArray.push("-Тате тате ти бил ли си програмист?<br/>-Да бил съм трима!");
        myArray.push("Двама програмисти свършват работа и единият моли другия<br/>-Можеш ли да ми заемеш 1000лв <br/>-Не може ли да ги закръглим на 1024?");
        myArray.push("Програмистка поговорка<br/>Ако програмата дава неверен резултат - в нея има грешка.<br/>А ако дава верен резултат - тогава в нея има поне две грешки.");
        myArray.push("Ако дебъгване е процесът по отстраняване на проблеми в програмния код, то тогава програмиране явно е процесът по вкарването им вътре");
        myArray.push("Първи урок по англииски. Учителката <br/>– Кой от вас, деца, знае английската азбука? <br/>Син на програмист <br/>– Аз!<br/>– Добре, казвай сега подред.<br/>– Q, W, E, R, T, Y …");



        var intArr = [];
        var range = 17;
        for (var i = 0; i < range; i++) {
            intArr.push(i + 1);
        }

        while(range > 0) {
            var k = Math.floor(Math.random() * range);
            range--;
            var temp = intArr[range];
            intArr[range] = intArr[k];
            intArr[k] = temp;
        }
        //fill articles with jokes
        for (var i = 1; i <= 4; i++) {
            var tagName = "#joke-" + i;
            console.log(tagName);
            console.log(myArray[intArr[i]]);
            $(tagName).html(myArray[intArr[i]]);
        }
    });

})(jQuery);
